print('Калькулятор'.center(30))

while True:
    try:
        a, b = tuple(map(int, input('Введіть два числа через пропуск: ').split(' ')))
    except:
        print('Не корректне введення.')
        continue
    print(f"""
    Оберіть дію для чисел {a} та {b}:
      0. Вихід
      1. Додавання {a} + {b}
      2. Віднімання {a} - {b}
      3. Множиння {a} * {b}
      4. Ділення {a} : {b}
      5. Піднесення числа {a} до степені {b}
      6. Сума квадратів чисе {a} та {b}
      7. Різниця квадратів числа {a} та {b}
      8. Квадрат суми чисел {a} та {b}
      9. Квадрат різниці чисел {a} та {b}
      10. Усі парні числа між числами {a} та {b}
      11. Усі не парні числа між числами {a} та {b}
      12. Залишок від ділення числа {a} на число {b}
    """)

    user_choice = input('Ваш вибір: ')

    if user_choice == '0':
        break
